In [1]:
import pandas as pd
import sqlalchemy as sql

In [2]:
database_connection_string = 'sqlite:///'

In [3]:
engine = sql.create_engine(
    database_connection_string
)

engine

Engine(sqlite:///)

In [4]:
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_14900\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

[]

In [5]:
stocks_dataframe = pd.DataFrame(
    {
        'AAPL': [
            1,
            2
        ]
        ,
        'GOOG': [
            3,
            4
        ]
    }
)

stocks_dataframe

   AAPL  GOOG
0     1     3
1     2     4

In [6]:
stocks_dataframe.to_sql(
    'stocks',
    engine
)

2

In [7]:
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_14900\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['stocks']

In [8]:
sql_stocks_df = pd.read_sql_table(
    'stocks',
    con= engine
)

sql_stocks_df

   index  AAPL  GOOG
0      0     1     3
1      1     2     4

In [14]:
stocks_dataframe.to_sql(
    'stocks',
    engine,
    index= False,
    if_exists= 'replace'
)

2

In [16]:
sql_stocks_df = pd.read_sql_table(
    'stocks',
    con= engine
)

sql_stocks_df

   AAPL  GOOG
0     1     3
1     2     4

___

# Skill Drill

In [9]:
database_connection_string = 'sqlite:///'

engine = sql.create_engine(
    database_connection_string
)

engine

Engine(sqlite:///)

In [10]:
stocks_df = pd.DataFrame(
    {
        'MSFT': [
            5,
            6
        ]
        ,
        'TSLA': [
            7,
            8
        ]
    }
)

stocks_df

   MSFT  TSLA
0     5     7
1     6     8

In [11]:
stocks_df.to_sql(
    'stocks',
    engine
)

2

In [12]:
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_14900\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['stocks']

In [13]:
sql_stocks_df = pd.read_sql_table(
    'stocks',
    con = engine
)

sql_stocks_df

   index  MSFT  TSLA
0      0     5     7
1      1     6     8

___

In [25]:
database_connection_string = 'sqlite:///'

engine = sql.create_engine(
    database_connection_string,
    echo = True
)

engine

Engine(sqlite:///)

In [26]:
stocks_dataframe

   AAPL  GOOG
0     1     3
1     2     4

In [27]:
stocks_dataframe.to_sql(
    'stocks',
    engine,
    index=False,
    if_exists='replace'
)

2023-02-09 23:39:10,993 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("stocks")
2023-02-09 23:39:11,001 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-09 23:39:11,001 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("stocks")
2023-02-09 23:39:11,004 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-09 23:39:11,005 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-02-09 23:39:11,005 INFO sqlalchemy.engine.Engine
CREATE TABLE stocks (
	"AAPL" BIGINT,
	"GOOG" BIGINT
)


2023-02-09 23:39:11,009 INFO sqlalchemy.engine.Engine [no key 0.00155s] ()
2023-02-09 23:39:11,013 INFO sqlalchemy.engine.Engine COMMIT
2023-02-09 23:39:11,014 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-02-09 23:39:11,016 INFO sqlalchemy.engine.Engine INSERT INTO stocks ("AAPL", "GOOG") VALUES (?, ?)
2023-02-09 23:39:11,019 INFO sqlalchemy.engine.Engine [generated in 0.00242s] ((1, 3), (2, 4))
2023-02-09 23:39:11,021 INFO sqlalchemy.engine.Engine COMMIT

2

In [28]:
create_table = """
CREATE TABLE stocks (
    'AAPL' BIGINT,
    'GOOG' BIGINT
)

"""

create_table

"\nCREATE TABLE stocks (\n    'AAPL' BIGINT,\n    'GOOG' BIGINT\n)\n\n"

___

In [29]:
create_table = """

CREATE TABLE delicious_stocks (
    'EAT' BIGINT,
    'CAKE' BIGINT
)

"""

create_table

"\n\nCREATE TABLE delicious_stocks (\n    'EAT' BIGINT,\n    'CAKE' BIGINT\n)\n\n"

In [30]:
engine.execute(
    create_table
)

2023-02-10 00:01:39,673 INFO sqlalchemy.engine.Engine

CREATE TABLE delicious_stocks (
    'EAT' BIGINT,
    'CAKE' BIGINT
)


2023-02-10 00:01:39,676 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 00:01:39,678 INFO sqlalchemy.engine.Engine COMMIT

In [32]:
engine.table_names()

2023-02-10 00:03:36,625 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2023-02-10 00:03:36,625 INFO sqlalchemy.engine.Engine [raw sql] ()

C:\Users\admin\AppData\Local\Temp\ipykernel_14900\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['delicious_stocks', 'stocks']